# Brewfile - Homebrew Bundle
# Install: brew bundle
# Update:  brew bundle dump --force

# =============================================================================
# CLI Tools
# =============================================================================

# Core utilities
brew "coreutils"      # GNU core utilities (prefixed with 'g')
brew "wget"
brew "htop"
brew "eza"            # Modern ls replacement

# Shell & prompt
brew "starship"       # Cross-shell prompt

# Development
brew "gh"             # GitHub CLI
brew "git-delta"      # Better git diffs
brew "node"
brew "go"
brew "ruby"
brew "openjdk"

# Media
brew "ffmpeg"
brew "youtubedr"

# Services
brew "tailscale", restart_service: :changed

# Modern CLI replacements
brew "bat"            # Better cat with syntax highlighting
brew "fd"             # Better find
brew "fzf"            # Fuzzy finder
brew "jq"             # JSON processor
brew "ripgrep"        # Better grep
brew "zoxide"         # Smarter cd command

# Optional extras (uncomment to install)
brew "tldr"         # Simplified man pages
brew "tree"         # Directory tree view
brew "tmux"         # Terminal multiplexer
brew "lazygit"      # Terminal UI for git
brew "direnv"       # Per-directory env vars
brew "httpie"       # Modern curl alternative
brew "uv"           # Fast Python package manager

# =============================================================================
# Applications (Casks)
# =============================================================================

# Browsers
cask "google-chrome"

# Development
cask "claude"
cask "claude-code"

# Media
cask "vlc"

# -----------------------------------------------------------------------------
# Recommended additions (uncomment to install)
# -----------------------------------------------------------------------------
cask "1password"          # Password manager
# cask "alfred"             # Spotlight replacement
# cask "raycast"            # Spotlight replacement (alternative)
cask "docker"             # Docker Desktop
cask "iterm2"             # Better terminal
cask "warp"               # Modern terminal
cask "visual-studio-code" # VS Code
# cask "obsidian"           # Note-taking
# cask "notion"             # Notes & docs
# cask "slack"              # Team chat
cask "discord"            # Chat
cask "spotify"            # Music
cask "rectangle"          # Window management
cask "karabiner-elements" # Keyboard customization
cask "bartender"          # Menu bar management

# =============================================================================
# Fonts
# =============================================================================

cask "font-cousine-nerd-font"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Additional Nerd Fonts
cask "font-meslo-lg-nerd-font"         # Clean, popular with Oh My Zsh
cask "font-victor-mono-nerd-font"      # Cursive italics, great for comments
cask "font-iosevka-nerd-font"          # Narrow, highly customizable
cask "font-sauce-code-pro-nerd-font"   # Adobe's coding font (Nerd Font version)
cask "font-roboto-mono-nerd-font"      # Google's monospace
cask "font-inconsolata-nerd-font"      # Classic coding font
cask "font-ubuntu-mono-nerd-font"      # Ubuntu's monospace
cask "font-caskaydia-cove-nerd-font"   # Microsoft Cascadia with ligatures (Nerd Font)
cask "font-monaspace-nf"               # GitHub's variable font family (Nerd Font)
cask "font-geist-mono-nerd-font"       # Vercel's modern font

# Non-Nerd Font versions (lighter, no icons)
cask "font-fira-code"                  # Ligatures only, no icons
cask "font-cascadia-code"              # Microsoft with ligatures
cask "font-source-code-pro"            # Adobe original
cask "font-monaspace"                  # GitHub's texture healing font

# UI/Design Fonts
cask "font-inter"                      # Popular UI font
cask "font-ibm-plex"                   # IBM's open font family
cask "font-open-sans"                  # Google's versatile sans-serif

# =============================================================================
# VS Code Extensions
# =============================================================================

# AI & Assistants
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "openai.chatgpt"

# API & Documentation
vscode "42crunch.vscode-openapi"
vscode "arjun.swagger-viewer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "humao.rest-client"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "mermaidchart.vscode-mermaid-chart"

# JavaScript/TypeScript
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "nrwl.angular-console"

# Docker & Containers
vscode "docker.docker"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"

# Python
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"

# C# / .NET
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"

# Infrastructure & DevOps
vscode "hashicorp.terraform"
vscode "ms-vscode.makefile-tools"

# GitHub
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"

# Other
vscode "contextmapper.context-mapper-vscode-extension"
vscode "dcortes92.freemarker"
vscode "ms-vsliveshare.vsliveshare"
